1c_um/src/Catalogs/ум_КлючиАналитикиПакетовДанных/ум_КлючиАналитикиПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_КлючиАналитикиПакетовДанных</name>
  <attributes>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПакетаДанных</name>
    <type>
      <types>EnumRef.ум_СостоянияПакетаДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

1c_um/src/CommonModules/ум_ПакетыДанныхПовтИсп/Module.bsl
Функция ПолучитьСпособОбработкиПоИмени(ИмяСпособаОбработки) Экспорт 
	
	Перем Результат;    
	
	Результат = Справочники.ум_СпособыОбработкиПакетов.ПустаяСсылка();		
	Если Не ЗначениеЗаполнено(ИмяСпособаОбработки) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_СпособыОбработкиПакетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
	|ГДЕ
	|	ум_СпособыОбработкиПакетов.ИмяДляРазработчика = &ИмяСпособаОбработки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_СпособыОбработкиПакетов.Ссылка
	|ИЗ
	|	Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
	|ГДЕ
	|	ум_СпособыОбработкиПакетов.Наименование = &ИмяСпособаОбработки";
	
	Запрос.УстановитьПараметр("ИмяСпособаОбработки", ИмяСпособаОбработки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();    
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКлючАналитикиПакетаДанных(СпособОбработкиПакетов, СостояниеПакетаДанных) Экспорт 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_КлючиАналитикиПакетовДанных.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|ГДЕ
	|	ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов = &СпособОбработки
	|	И ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных = &Состояние";	  
	                                  
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СпособОбработки"	, СпособОбработкиПакетов);
	Запрос.УстановитьПараметр("Состояние"		, СостояниеПакетаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;     
	
КонецФункции

Функция ПолучитьКлючиАналитикиПакетаДанных(СпособОбработкиПакетов) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпособОбработки", СпособОбработкиПакетов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ум_КлючиАналитикиПакетовДанных.Ссылка КАК Ссылка,
	|	ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных КАК СостояниеПакетаДанных
	|ИЗ
	|	Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|ГДЕ
	|	ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов = &СпособОбработки";
	
	Результат = Новый Соответствие;
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить(Выборка.СостояниеПакетаДанных, Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкиЛогированияФЗ() Экспорт
	ум_ЛогированиеФЗ = Константы.ум_ВключитьЛогированиеФЗ.Получить();
	ум_ТаймаутУдаленияЛоговФЗ = Константы.ум_ТаймаутУдаленияЛоговФЗ.Получить();
	Структура = Новый Структура("ТаймаутУдаленияЛоговФЗ, ЛогированиеФЗ", ум_ТаймаутУдаленияЛоговФЗ, ум_ЛогированиеФЗ);
	Возврат Структура;
КонецФункции
